[
    {
        "Call Direction": "inbound",
        "Call Type": "Order Tracking",
        "Call Type Description": "Customers calling to inquire about the status of their online orders, including shipping timelines, delivery dates, and order cancellations.",
        "Common Inquiries": "Order status, shipping details, delivery times, cancellation requests"
    },
    {
        "Call Direction": "inbound",
        "Call Type": "Product Information",
        "Call Type Description": "Customers seeking information about specific products, such as features, sizes, colors, pricing, and availability.",
        "Common Inquiries": "Product features, sizes, colors, pricing, availability, product comparisons"
    },
    {
        "Call Direction": "inbound",
        "Call Type": "Return and Exchange",
        "Call Type Description": "Customers calling to initiate returns, exchanges, or refunds for purchased products, including questions about store policies and procedures.",
        "Common Inquiries": "Return policy, exchange process, refund timelines, store credit"
    },
    {
        "Call Direction": "inbound",
        "Call Type": "Account and Payment",
        "Call Type Description": "Customers calling to inquire about their account information, including login issues, payment methods, and billing inquiries.",
        "Common Inquiries": "Account login, payment options, billing questions, payment status"
    },
    {
        "Call Direction": "inbound",
        "Call Type": "Warranty and Repair",
        "Call Type Description": "Customers calling to inquire about warranty information, repair options, and maintenance services for their purchased products.",
        "Common Inquiries": "Warranty details, repair options, maintenance services, product recalls"
    },
    {
        "Call Direction": "outbound",
        "Call Type": "Welcome and Onboarding",
        "Call Type Description": "Outbound calls to welcome new customers, introduce them to products and services, and provide onboarding guidance.",
        "Common Inquiries": "Product benefits, service features, account setup, loyalty programs"
    },
    {
        "Call Direction": "outbound",
        "Call Type": "Special Offers and Promotions",
        "Call Type Description": "Outbound calls to inform customers about limited-time offers, discounts, and special promotions.",
        "Common Inquiries": "Offer details, promotion eligibility, discount codes, loyalty rewards"
    },
    {
        "Call Direction": "outbound",
        "Call Type": "Customer Feedback and Survey",
        "Call Type Description": "Outbound calls to collect customer feedback, conduct surveys, and gather insights to improve products and services.",
        "Common Inquiries": "Survey questions, feedback collection, product improvement suggestions"
    },
    {
        "Call Direction": "outbound",
        "Call Type": "Abandoned Cart Follow-up",
        "Call Type Description": "Outbound calls to follow up with customers who have abandoned their online shopping carts, to help complete their purchases.",
        "Common Inquiries": "Cart contents, purchase completion, product availability, special offers"
    },
    {
        "Call Direction": "outbound",
        "Call Type": "Loyalty Program Updates",
        "Call Type Description": "Outbound calls to inform customers about loyalty program updates, rewards, and benefits.",
        "Common Inquiries": "Program updates, reward balances, benefit explanations, loyalty tier status"
    }
]