[
    {
        "Index": "1",
        "Section": "Greeting",
        "Question": "Did the agent greet the customer promptly and courteously, acknowledging their concern about their payment or account issue?",
        "Scoring": "Yes / No",
        "Scoring Criteria": "**Yes:** Agent greeted the customer within 5 seconds of connection, using phrases like 'Good morning/afternoon/evening' in a friendly and upbeat tone, and acknowledged their concern. **No:** Agent took longer than 5 seconds to greet or used a monotone/apathetic tone."
    },
    {
        "Index": "2",
        "Section": "Greeting",
        "Question": "Did the agent introduce themselves and the DIY store they represent?",
        "Scoring": "Yes / No",
        "Scoring Criteria": "**Yes:** Agent clearly stated their full name and the DIY store's name within the first 10 seconds of the call, e.g., 'Hello, this is [Agent's Name] from [DIY Store Name].' **No:** Agent failed to provide their name or the DIY store's name, or mumbled it so it was unclear."
    },
    {
        "Index": "3",
        "Section": "Greeting",
        "Question": "Did the agent thank the customer for contacting the DIY store about their payment or account issue?",
        "Scoring": "Yes / No",
        "Scoring Criteria": "**Yes:** Agent explicitly thanked the customer by saying something like 'Thank you for calling [DIY Store Name] about your payment/account issue.' **No:** Agent did not express any form of gratitude."
    },
    {
        "Index": "4",
        "Section": "Customer Identification",
        "Question": "Did the agent verify the customer's identity as appropriate for their payment or account issue?",
        "Scoring": "Yes / No",
        "Scoring Criteria": "**Yes:** Agent followed security protocols by asking for 2-3 pieces of verification information (e.g., account number, date of birth) and confirmed them against company records. **No:** Agent skipped verification or did it improperly, risking a security breach. **N/A:** Verification not required for the nature of the call."
    },
    {
        "Index": "5",
        "Section": "Customer Identification",
        "Question": "Did the agent confirm the customer's contact details and information related to their payment or account issue?",
        "Scoring": "Yes / No",
        "Scoring Criteria": "**Yes:** Agent repeated back key information such as phone number, email, or address for confirmation and asked the customer to verify its accuracy. **No:** Agent did not confirm or repeated information incorrectly."
    },
    {
        "Index": "6",
        "Section": "Customer Identification",
        "Question": "Did the agent ensure the customer's account information was up to date and relevant to their payment or account issue?",
        "Scoring": "Yes / No",
        "Scoring Criteria": "**Yes:** Agent asked if there were any updates to contact or account information and made necessary changes in the system. **No:** Agent did not inquire about or update any account information."
    },
    {
        "Index": "7",
        "Section": "Needs Identification",
        "Question": "Did the agent listen actively to the customer's concern about their payment or account issue without interrupting?",
        "Scoring": "Yes / No",
        "Scoring Criteria": "**Yes:** Agent allowed the customer to fully explain their issue without interruption, used verbal nods ('I understand,' 'Right,' 'Please go on') to show attentiveness. **No:** Agent interrupted the customer multiple times or appeared to be distracted."
    },
    {
        "Index": "8",
        "Section": "Needs Identification",
        "Question": "Did the agent ask relevant clarifying questions to understand the customer's payment or account issue better?",
        "Scoring": "Yes / No",
        "Scoring Criteria": "**Yes:** Agent asked specific, open-ended questions related to the issue ('Can you tell me more about...?'). **No:** Agent asked irrelevant or no clarifying questions, leading to misunderstandings."
    },
    {
        "Index": "9",
        "Section": "Needs Identification",
        "Question": "Did the agent summarize the customer's payment or account issue to confirm understanding?",
        "Scoring": "Yes / No",
        "Scoring Criteria": "**Yes:** Agent recapped the main points of the customer's issue accurately before proceeding, saying something like, 'So, to confirm, you're having an issue with...'. **No:** Agent did not summarize or summarized incorrectly, causing confusion."
    },
    {
        "Index": "10",
        "Section": "Solution Proposal",
        "Question": "Did the agent demonstrate knowledge of DIY store's payment and account processes?",
        "Scoring": "Yes / No",
        "Scoring Criteria": "**Yes:** Agent provided detailed and accurate information about the DIY store's payment and account processes, including relevant features and functionality. **No:** Agent gave incorrect information, was unsure, or had to repeatedly consult a knowledge base."
    },
    {
        "Index": "11",
        "Section": "Solution Proposal",
        "Question": "Did the agent provide an accurate and appropriate solution to the customer's payment or account issue?",
        "Scoring": "Yes / No",
        "Scoring Criteria": "**Yes:** Agent offered a solution that directly addressed the customer's issue and explained why it would work. **No:** Agent suggested irrelevant solutions or failed to provide a solution altogether."
    },
    {
        "Index": "12",
        "Section": "Solution Proposal",
        "Question": "Did the agent explain the solution clearly and comprehensively, including any necessary next steps?",
        "Scoring": "Yes / No",
        "Scoring Criteria": "**Yes:** Agent used direct and simple language to explain the solution step-by-step, ensuring the customer understood. **No:** Agent used technical jargon, spoke too quickly, or did not explain the solution fully."
    },
    {
        "Index": "13",
        "Section": "Solution Proposal",
        "Question": "Did the agent discuss any potential risks or limitations of the proposed solution, if applicable?",
        "Scoring": "Yes / No",
        "Scoring Criteria": "**Yes:** Agent clearly outlined any potential risks, side effects, or limitations of the solution, and suggested precautions if applicable. **No:** Agent failed to mention significant risks or limitations. **N/A:** No potential risks or downsides associated with the solution."
    },
    {
        "Index": "14",
        "Section": "Value Add / Upsell",
        "Question": "Did the agent offer any additional products or services that could benefit the customer's DIY project or renovation?",
        "Scoring": "Yes / No",
        "Scoring Criteria": "**Yes:** Agent identified and suggested relevant additional products or services tailored to the customer's needs without being pushy. **No:** Agent missed an opportunity for a relevant upsell. **N/A:** Upsell not applicable in the context of the call."
    },
    {
        "Index": "15",
        "Section": "Value Add / Upsell",
        "Question": "Did the agent explain the benefits of the additional products or services?",
        "Scoring": "Yes / No",
        "Scoring Criteria": "**Yes:** Agent clearly outlined how the additional product/service would benefit the customer, using specific examples or scenarios. **No:** Agent did not explain the benefits or did so inadequately. **N/A:** Upsell not applicable."
    },
    {
        "Index": "16",
        "Section": "Value Add / Upsell",
        "Question": "Did the agent handle any objections to the upsell professionally and effectively?",
        "Scoring": "Yes / No",
        "Scoring Criteria": "**Yes:** Agent acknowledged the customer's objections, addressed concerns calmly, and provided additional information to alleviate doubts. **No:** Agent dismissed objections or responded defensively. **N/A:** No objections raised or upsell not applicable."
    },
    {
        "Index": "17",
        "Section": "Closing",
        "Question": "Did the agent confirm the resolution or next steps with the customer for their payment or account issue?",
        "Scoring": "Yes / No",
        "Scoring Criteria": "**Yes:** Agent summarized what was done or what will happen next, including timeframes if applicable, and confirmed the customer’s understanding. **No:** Agent did not confirm the resolution or next steps."
    },
    {
        "Index": "18",
        "Section": "Closing",
        "Question": "Did the agent offer any additional assistance before ending the call?",
        "Scoring": "Yes / No",
        "Scoring Criteria": "**Yes:** Agent asked an open-ended question such as, 'Is there anything else I can help you with today?' **No:** Agent did not inquire if further assistance was needed."
    },
    {
        "Index": "19",
        "Section": "Closing",
        "Question": "Did the agent close the call courteously and thank the customer for their business?",
        "Scoring": "Yes / No",
        "Scoring Criteria": "**Yes:** Agent used a polite closing statement like, 'Thank you for calling, and have a great day!' **No:** Agent ended the call abruptly or without a courteous closing."
    },
    {
        "Index": "20",
        "Section": "Closing",
        "Question": "Did the agent ensure the customer was satisfied with the resolution before ending the call?",
        "Scoring": "Yes / No",
        "Scoring Criteria": "**Yes:** Agent explicitly asked if the customer was satisfied with the resolution and if they had any more concerns. **No:** Agent did not check the customer's satisfaction level before ending the call."
    },
    {
        "Index": "21",
        "Section": "Rapport",
        "Question": "Did the agent show empathy and understanding of the customer's frustration or concern about their payment or account issue?",
        "Scoring": "Yes / No",
        "Scoring Criteria": "**Yes:** Agent used empathetic statements like, 'I understand how frustrating this must be for you,' and validated the customer’s feelings. **No:** Agent did not acknowledge the customer's emotions or came across as indifferent."
    },
    {
        "Index": "22",
        "Section": "Rapport",
        "Question": "Did the agent personalize the interaction by using the customer's name and referencing their specific DIY project or needs?",
        "Scoring": "Yes / No",
        "Scoring Criteria": "**Yes:** Agent used the customer's name multiple times during the call and referenced specific details relevant to the customer’s situation. **No:** Agent did not use the customer's name or personalize the conversation."
    },
    {
        "Index": "23",
        "Section": "Rapport",
        "Question": "Did the agent maintain a courteous and professional tone throughout the call?",
        "Scoring": "Yes / No",
        "Scoring Criteria": "**Yes:** Agent consistently used polite language, maintained a professional demeanor, and showed respect throughout the call. **No:** Agent used informal, slang, or rude language, or was condescending."
    },
    {
        "Index": "24",
        "Section": "Rapport",
        "Question": "Did the agent use clear and understandable language when explaining payment or account processes and solutions?",
        "Scoring": "Yes / No",
        "Scoring Criteria": "**Yes:** Agent used simple, jargon-free language that was easy for the customer to understand. **No:** Agent used technical terms without explanation or spoke too quickly."
    },
    {
        "Index": "25",
        "Section": "Rapport",
        "Question": "Did the agent handle any difficult situations or objections calmly and effectively?",
        "Scoring": "Yes / No",
        "Scoring Criteria": "**Yes:** Agent stayed calm, listened actively, acknowledged the customer's frustration, and provided clear, constructive responses. **No:** Agent became defensive, raised their voice, or failed to manage the situation effectively."
    },
    {
        "Index": "26",
        "Section": "Rapport",
        "Question": "Did the agent make the customer feel valued and appreciated, acknowledging their business and loyalty to the DIY store?",
        "Scoring": "Yes / No",
        "Scoring Criteria": "**Yes:** Agent made positive affirmations, thanked the customer for their business, and made them feel their issue was important. **No:** Agent did not make any effort to make the customer feel valued or appreciated."
    }
]